Repository: hiphoox/experior
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Activities
es: Actividades

source: Reports
es: Reportes

source: About
es: Acerca de

source: Help
es: Ayuda

source: Thanks for spending some quality time with the Time Tracking site today.
es: Gracias por invertir el día de hoy algo de tu valioso tiempo en el Sistema de Actividades

source: Welcome
es: Bienvenido

source: Here you can register and check your activities!
es: Aquí puedes registrarte y validar tus actividades!

source: Anonymous user! You need to
es: Usuario anonimo! Necesitas registrarte

source: before you can register and check your activities.
es: antes de que puedas capturar o validar tus actividades

source: gives you all you need. Get one step closer to admin nirvana
es: te da todo lo que necesitas. Acercate un paso más al nirvana de la administración

source: Links
es: Ligas

source: News
es: Noticias

source: Subscribe to rss
es: Suscribete al rss

source: Get the latest testing news in your newsreader.
es: Obten las últimas noticias en tu lector de noticas.

source: Subscribe to the feed.
es: Suscribete al feed.

source: Your username and password did not match. Please try again.
es: Tu usuaario y contraseña no coinciden. Por favor intenta nuevamente

source: Username:
es: Usuario:

source: Password:
es: Contraseña:

source: Experior admin
es: Administración de Experior

source: Experior administration
es: Administración de Experior
